/*! \file nfapi/open-nFAPI/nfapi/public_inc/nfapi_nr_interface_scfv2.h
 * \brief Create FAPI(P5) data structure and revise FAPI(P7) data structure
 * \author NCTU OpinConnect Terng-Yin Hsu, Sendren Xu, WEI-YING LIN, Hong-Ming Huang
 * \email  a22490010@gmail.com
 * \date   31-10-2021
 * \version 2.0
 * \note
 * \warning
 */


#include "stddef.h"
#include "nfapi_interface.h"
#include "nfapi_nr_interface.h"
//  2021.05
// SCF222_5G-FAPI_PHY_SPI_Specificayion.pdf
// Section 3.2 Messages Types
typedef enum {
  NFAPI_NR_PHY_MSG_TYPE_PARAM_REQUEST=  0x00,
  NFAPI_NR_PHY_MSG_TYPE_PARAM_RESPONSE= 0x01,
  NFAPI_NR_PHY_MSG_TYPE_CONFIG_REQUEST= 0x02,
  NFAPI_NR_PHY_MSG_TYPE_CONFIG_RESPONSE=0X03,
  NFAPI_NR_PHY_MSG_TYPE_START_REQUEST=  0X04,
  NFAPI_NR_PHY_MSG_TYPE_STOP_REQUEST=   0X05,
  NFAPI_NR_PHY_MSG_TYPE_STOP_INDICATION=0X06,
  NFAPI_NR_PHY_MSG_TYPE_ERROR_INDICATION=0X07,
  NFAPI_NR_PHY_MSG_TYPE_START_RESPONSE=0x108,
  //RESERVED 0X08 ~ 0X7F
  NFAPI_NR_PHY_MSG_TYPE_DL_TTI_REQUEST= 0X80,
  NFAPI_NR_PHY_MSG_TYPE_UL_TTI_REQUEST= 0X81,
  NFAPI_NR_PHY_MSG_TYPE_SLOT_INDICATION=0X82,
  NFAPI_NR_PHY_MSG_TYPE_UL_DCI_REQUEST= 0X83,
  NFAPI_NR_PHY_MSG_TYPE_TX_DATA_REQUEST=0X84, 
  NFAPI_NR_PHY_MSG_TYPE_RX_DATA_INDICATION=0X85,
  NFAPI_NR_PHY_MSG_TYPE_CRC_INDICATION= 0X86,
  NFAPI_NR_PHY_MSG_TYPE_UCI_INDICATION= 0X87,
  NFAPI_NR_PHY_MSG_TYPE_SRS_INDICATION= 0X88,
  NFAPI_NR_PHY_MSG_TYPE_RACH_INDICATION= 0X89,
  //RESERVED 0X8a ~ 0xff
  NFAPI_NR_PHY_MSG_TYPE_UL_NODE_SYNC = 0x180,

#define  NFAPI_NR_PARAM_TLV_PUSCH_VRB_TO_PRB_MAPPING_TAG 0x002A
#define  NFAPI_NR_PARAM_TLV_PUSCH_MAX_PTRS_PORTS_TAG 0x002B
#define  NFAPI_NR_PARAM_TLV_MAX_PDUSCHS_TBS_PER_SLOT_TAG 0x002C
#define  NFAPI_NR_PARAM_TLV_MAX_NUMBER_MIMO_LAYERS_NON_CB_PUSCH_TAG 0x002D
#define  NFAPI_NR_PARAM_TLV_SUPPORTED_MODULATION_ORDER_UL_TAG 0x002E
#define  NFAPI_NR_PARAM_TLV_MAX_MU_MIMO_USERS_UL_TAG 0x002F
#define  NFAPI_NR_PARAM_TLV_DFTS_OFDM_SUPPORT_TAG 0x0030
#define  NFAPI_NR_PARAM_TLV_PUSCH_AGGREGATION_FACTOR_TAG 0x0031
#define  NFAPI_NR_PARAM_TLV_PRACH_LONG_FORMATS_TAG 0x0032
#define  NFAPI_NR_PARAM_TLV_PRACH_SHORT_FORMATS_TAG 0x0033
#define  NFAPI_NR_PARAM_TLV_PRACH_RESTRICTED_SETS_TAG 0x0034
#define  NFAPI_NR_PARAM_TLV_MAX_PRACH_FD_OCCASIONS_IN_A_SLOT_TAG 0x0035
#define  NFAPI_NR_PARAM_TLV_RSSI_MEASUREMENT_SUPPORT_TAG 0x0036
// FAPI V3
//#define NFAPI_NR_PARAM_TLV__TAG
#define NFAPI_NR_PARAM_TLV_POWER_PROFILES_SUPPORTED_TAG 0x0038
#define NFAPI_NR_PARAM_TLV_MAX_NUM_PDUS_INDL_TTI_TAG 0x0039
#define NFAPI_NR_PARAM_TLV_MAX_NUM_PDUS_INUL_TTI_TAG 0x003A
#define NFAPI_NR_PARAM_TLV_MAX_NUM_PDUS_INUL_DCI_TAG 0x003B
#define NFAPI_NR_PARAM_TLV_SS_PBCH_MULTIPLE_CARRIERS_IN_AB_AND_TAG 0x003C
#define NFAPI_NR_PARAM_TLV_MULTIPLE_CELLS_SS_PBCH_IN_A_CARRIER_TAG 0x003D
#define NFAPI_NR_PARAM_TLV_PUCCH_GROUP_AND_SEQUENCE_HOPPING_TAG 0x003E
#define NFAPI_NR_PARAM_TLV_MAX_NUM_UL_BWP_IDS_TAG 0x003F
#define NFAPI_NR_PARAM_TLV_PUCCH_AGGREGATION_TAG 0x0040
#define NFAPI_NR_PARAM_TLV_SSB_RATE_MATCH_TAG 0x0041
#define NFAPI_NR_PARAM_TLV_SUPPORTED_RATE_MATCH_PATTERN_TYPE_TAG 0x0042
#define NFAPI_NR_PARAM_TLV_PDCCH_RATE_MATCH_TAG 0x0043
#define NFAPI_NR_PARAM_TLV_NUM_OF_RATE_MATCH_PATTERN_LTE_CRS_PER_SLOT_TAG 0x0044
#define NFAPI_NR_PARAM_TLV_NUM_OF_RATE_MATCH_PATTERN_LTE_CRS_IN_PHY_TAG 0x0045
#define NFAPI_NR_PARAM_TLV_CSI_RS_RATE_MATCH_TAG 0x0046
#define NFAPI_NR_PARAM_TLV_PDSCH_TRANS_PYPE_SUPPORT_TAG 0x0047
#define NFAPI_NR_PARAM_TLV_PDSCH_MAC_PDU_BIT_ALIGNMENT_TAG 0x0048
#define NFAPI_NR_PARAM_TLV_MAX_NUMBER_MIMO_LAYERS_CB_PUSCH_TAG 0x0049
#define NFAPI_NR_PARAM_TLV_PUSCH_LBRM_SUPPORT_TAG 0x004A
#define NFAPI_NR_PARAM_TLV_PUSCH_TRANS_TYPE_SUPPORT_TAG 0x004B
#define NFAPI_NR_PARAM_TLV_PUSCH_MAC_PDU_BIT_ALIGNMENT_TAG 0x004C
#define NFAPI_NR_PARAM_TLV_MAX_NUM_PRACH_CONFIGURATIONS_TAG 0x004D
#define NFAPI_NR_PARAM_TLV_PRACH_MULTIPLE_CARRIERS_IN_AB_AND_TAG 0x004E
#define NFAPI_NR_PARAM_TLV_MAX_NUM_UCI_MAPS_TAG 0x004F
#define NFAPI_NR_PARAM_TLV_NUM_CAPABILITIES_TAG 0x0050
// may fix!
//table 3-22
#define NFAPI_NR_PARAM_TLV_PHY_PROFILE_SUPPORT_PARAMETERS_TAG 0x0051
#define NFAPI_NR_PARAM_TLV_TIME_MANAGEMENT_TAG 0x0052
#define NFAPI_NR_PARAM_TLV_PROTOCOL_VERSION_TAG 0x0053
#define NFAPI_NR_PARAM_TLV_MORE_THAN_ONE_INDICATION_PER_SLOT_TAG 0x0055
#define NFAPI_NR_PARAM_TLV_MORE_THAN_ONE_REQUEST_PER_SLOT_TAG 0x0056
//table 3-23
#define NFAPI_NR_PARAM_TLV_PAIRINGS_OF_PHY_AND_DFE_PROFILES_TAG 0x0054
//table 3-25 Rel-16 mTRP parameters
#define NFAPI_NR_PARAM_TLV_MTRP_PARAMETERS_TAG 0x0057


/* 3.3.1.1 PARAM.request */
typedef struct{
    nfapi_nr_p5_message_header_t header;
    uint8_t protocolVersion;
}nfapi_nr_param_request_scf_t;


/* 3.3.1.2 PARAM.response */
//Table 3-12 Cell and PHY parameters (incomplete)
typedef struct{
  
    nfapi_uint16_tlv_t release_capability; //TAG 0x0001
    nfapi_uint16_tlv_t phy_state;
    nfapi_uint8_tlv_t  skip_blank_dl_config;
    nfapi_uint8_tlv_t  skip_blank_ul_config;
    nfapi_uint16_tlv_t num_config_tlvs_to_report;
    nfapi_uint8_tlv_t* config_tlvs_to_report_list;
    //fix me!!
    nfapi_uint8_tlv_t power;

    nfapi_uint16_tlv_t maxNumPDUsInDL_TTI;
    nfapi_uint16_tlv_t maxNumPDUsInUL_TTI;
    nfapi_uint16_tlv_t maxNumPDUsInUL_DCI;
} nfapi_nr_cell_param_t;

//Table 3-13 Carrier parameters
typedef struct {
  nfapi_uint8_tlv_t  cyclic_prefix;//TAG 0x0006
  nfapi_uint8_tlv_t  supported_subcarrier_spacings_dl;
  nfapi_uint16_tlv_t supported_bandwidth_dl;
  nfapi_uint8_tlv_t  supported_subcarrier_spacings_ul;
  nfapi_uint16_tlv_t supported_bandwidth_ul;
  nfapi_uint8_tlv_t ssPbchMultipleCarriersInABand;
  nfapi_uint8_tlv_t multipleCellsSsPbchInACarrier;
} nfapi_nr_carrier_param_t;

//Table 3-14 PDCCH parameters
typedef struct {
  nfapi_uint8_tlv_t  cce_mapping_type;
  nfapi_uint8_tlv_t  coreset_outside_first_3_of_ofdm_syms_of_slot;
  nfapi_uint8_tlv_t  precoder_granularity_coreset;
  nfapi_uint8_tlv_t  pdcch_mu_mimo;
  nfapi_uint8_tlv_t  pdcch_precoder_cycling;
  nfapi_uint8_tlv_t  max_pdcch_per_slot;
} nfapi_nr_pdcch_param_t;

//Table 3-15 PUCCH parameters
typedef struct {
    nfapi_uint8_tlv_t pucch_formats;//0011
    nfapi_uint8_tlv_t max_pucchs_per_slot;
    nfapi_uint8_tlv_t pucchGroupAndSequenceHopping;//003E
    nfapi_uint8_tlv_t maxNumUlBwpIds;//003F
} nfapi_nr_pucch_param_t;

//Table 3-16 PDSCH parameters
typedef struct {
    nfapi_uint8_tlv_t pdsch_mapping_type;//0013
    nfapi_uint8_tlv_t pdsch_allocation_types;
    nfapi_uint8_tlv_t pdsch_vrb_to_prb_mapping;
    nfapi_uint8_tlv_t pdsch_cbg;
    nfapi_uint8_tlv_t pdsch_dmrs_config_types;
    nfapi_uint8_tlv_t pdsch_dmrs_max_length;
    nfapi_uint8_tlv_t pdsch_dmrs_additional_pos;
    nfapi_uint8_tlv_t max_pdsch_tbs_per_slot;
    nfapi_uint8_tlv_t max_number_mimo_layers_pdsch;
    nfapi_uint8_tlv_t supported_max_modulation_order_dl;
    nfapi_uint8_tlv_t max_mu_mimo_users_dl;
    nfapi_uint8_tlv_t pdsch_data_in_dmrs_symbols;
    nfapi_uint8_tlv_t premption_support;
    nfapi_uint8_tlv_t pdsch_non_slot_support;
    nfapi_uint8_tlv_t ssbRateMatch;//0041
    nfapi_uint16_tlv_t supportedRateMatchPatternType;//0042
    nfapi_uint8_tlv_t pdcchRateMatch;//0043
    nfapi_uint8_tlv_t numOfRateMatchPatternLTECrsPerSlot;//0044
    nfapi_uint8_tlv_t numOfRateMatchPatternLTECrsInPhy;//0045
    nfapi_uint8_tlv_t csiRsRateMatch;//0046
    nfapi_uint8_tlv_t pdschTransTypeSupport;//0047
    nfapi_uint8_tlv_t pdschMacPduBitAlignment;//0048
} nfapi_nr_pdsch_param_t;
//Table 3-17 PUSCH parameters
typedef struct {
  nfapi_uint8_tlv_t uci_mux_ulsch_in_pusch;
  nfapi_uint8_tlv_t uci_only_pusch;
  nfapi_uint8_tlv_t pusch_frequency_hopping;
  nfapi_uint8_tlv_t pusch_dmrs_config_types;
  nfapi_uint8_tlv_t pusch_dmrs_max_len;
  nfapi_uint8_tlv_t pusch_dmrs_additional_pos;
  nfapi_uint8_tlv_t pusch_cbg;
  nfapi_uint8_tlv_t pusch_mapping_type;
  nfapi_uint8_tlv_t pusch_allocation_types;
  nfapi_uint8_tlv_t pusch_vrb_to_prb_mapping;
  nfapi_uint8_tlv_t pusch_max_ptrs_ports;
  nfapi_uint8_tlv_t max_pduschs_tbs_per_slot;
  nfapi_uint8_tlv_t max_number_mimo_layers_non_cb_pusch;
  nfapi_uint8_tlv_t maxNumberMimoLayersCbPusch;//0049
  nfapi_uint8_tlv_t supported_modulation_order_ul;
  nfapi_uint8_tlv_t max_mu_mimo_users_ul;
  nfapi_uint8_tlv_t dfts_ofdm_support;
  nfapi_uint8_tlv_t pusch_aggregation_factor;
  nfapi_uint8_tlv_t puschLbrmSupport;//004A
  nfapi_uint8_tlv_t puschTransTypeSupport;//004B
  nfapi_uint8_tlv_t puschMacPduBitAlignment;//004C
} nfapi_nr_pusch_param_t;

//Table 3-18 PRACH parameters
typedef struct {
    nfapi_uint8_tlv_t prach_long_formats;
    nfapi_uint8_tlv_t prach_short_formats;
    nfapi_uint8_tlv_t prach_restricted_sets;
    nfapi_uint8_tlv_t max_prach_fd_occasions_in_a_slot;
    nfapi_uint16_tlv_t maxNumPrachConfigurations;
    nfapi_uint8_tlv_t prachMultipleCarriersInABand;
} nfapi_nr_prach_param_t;

//Table 3-19 Measurement parameters
typedef struct {
    nfapi_uint8_tlv_t rssi_measurement_support;
} nfapi_nr_measurement_param_t;

//Table 3-20 UCI parameters
typedef struct{
    nfapi_uint16_tlv_t maxNumUciMaps;
}nfapi_nr_uci_param_t;

//table 3-21 Capability validity scope
typedef struct{
    nfapi_uint16_tlv_t  CapabilityTag;
    nfapi_uint8_tlv_t   ValidityScope;
}nfapi_nr_num_capabilities_t;
typedef struct {
    nfapi_uint16_tlv_t numCapabilities;
    nfapi_nr_num_capabilities_t* numCapabilities_list;
}nfapi_nr_capability_validity_scope_t;

//Table 3-22 PHY Support
typedef struct{
    nfapi_uint8_tlv_t numDlPortRanges;
    nfapi_uint16_tlv_t dlPortRangeStart;//[numDlPortRanges]
    nfapi_uint16_tlv_t dlPortRangeLen;//[numDlPortRanges]
    nfapi_uint8_tlv_t numUlPortRanges;
    nfapi_uint16_tlv_t ulPortRangeStart;//[numUlPortRanges]
    nfapi_uint16_tlv_t ulPortRangeLen;//[numUlPortRanges]
}nfapi_nr_max_num_phys_t;
typedef struct{
    nfapi_uint8_tlv_t maxNumPhys;
    nfapi_nr_max_num_phys_t maxnumphyslist;
}nfapi_nr_num_phy_profiles_t;
typedef struct{
    nfapi_uint16_tlv_t numPhyProfiles;
    nfapi_uint16_tlv_t numDlBbPorts;
    nfapi_uint16_tlv_t numUlBbPorts;
    nfapi_nr_num_phy_profiles_t numphyprofile;
    nfapi_uint8_tlv_t Time_Management;
    nfapi_uint8_tlv_t phyFapiProtocolVersion;
    nfapi_uint8_tlv_t phyFapiNegotiatedProtocolVersion;
    nfapi_uint8_tlv_t moreThanOneIndicationPerSlot[6];
    nfapi_uint8_tlv_t moreThanOneRequestPerSlot[4];
} nfapi_nr_phy_profile_support_param_t;
//Table 3-23 PHY / DFE Profile Validity Map
typedef struct{
    nfapi_uint16_tlv_t numPhyProfiles;
    nfapi_uint16_tlv_t numDfeProfiles;
    nfapi_uint8_tlv_t profileValidityMap;
}nfapi_nr_phy_dfe_profile_validity_map_t;
//Table 3-24 Delay management parameters
typedef struct{
    nfapi_uint32_tlv_t DL_TTI_Timingoffset;//0106
    nfapi_uint32_tlv_t UL_TTI_Timingoffset;//0107
    nfapi_uint32_tlv_t UL_DCI_Timingoffset;//0108
    nfapi_uint32_tlv_t Tx_Data_Timingoffset;//0109
    nfapi_uint16_tlv_t Timing_window;//011E
    nfapi_uint8_tlv_t Timing_info_period;//0120
}nfapi_nr_delay_management_param_t;
//Table 3-25 Rel-16 mTRP parameters
typedef struct{
    nfapi_uint32_tlv_t mTRP_Support; 
}nfapi_nr_rel16_mtrp_param_t;
// Table 3-10 PARAM.response TLVs
typedef struct {
    nfapi_nr_p5_message_header_t header;
    uint8_t error_code;
    uint8_t num_tlv;

    nfapi_nr_cell_param_t         cell_param;
    nfapi_nr_carrier_param_t      carrier_param;
    nfapi_nr_pdcch_param_t        pdcch_param;
    nfapi_nr_pucch_param_t        pucch_param;
    nfapi_nr_pdsch_param_t        pdsch_param;
    nfapi_nr_pusch_param_t        pusch_param;
    nfapi_nr_prach_param_t        prach_param;
    nfapi_nr_measurement_param_t  measurement_param;
    nfapi_nr_capability_validity_scope_t capa_vali_scope;
    nfapi_nr_phy_profile_support_param_t phy_profiles_param;
    nfapi_nr_phy_dfe_profile_validity_map_t phydfeprofilevaildity;
    nfapi_nr_delay_management_param_t delaymanageparam;
    nfapi_nr_rel16_mtrp_param_t rel16mtrpparam;
} nfapi_nr_param_response_scf_t;

/* 3.3.2 CONFIG */

//Table 3-30 PHY configuration
#define NFAPI_NR_CONFIG_PHY_PROFILE_ID_TAG 0x102A
#define NFAPI_NR_CONFIG_INDICATION_INSTANCES_PER_SLOT_TAG 0x102B
#define NFAPI_NR_CONFIG_REQUEST_INSTANCES_PER_SLOT_TAG 0x102C
//Table 3-31 Carrier configuration
#define NFAPI_NR_CONFIG_CARRIER_CONFIGURATION_TAG 0x102D
//Table 3-32 Cell configuration
#define NFAPI_NR_CONFIG_PHY_CELL_ID_TAG 0x100C
#define NFAPI_NR_CONFIG_FRAME_DUPLEX_TYPE_TAG 0x100D
#define NFAPI_NR_CONFIG_PDSCH_TRANS_TYPE_VALIDITY_TAG 0x102E
#define NFAPI_NR_CONFIG_PUSCH_TRANS_TYPE_VALIDITY_TAG 0x102F
//Table 3-33 SSB power and PBCH configuration
#define NFAPI_NR_CONFIG_SS_PBCH_POWER_TAG 0x100E
#define NFAPI_NR_CONFIG_SS_PBCH_BLOCK_POWER_SCALING_TAG 0x1030
#define NFAPI_NR_CONFIG_BCH_PAYLOAD_TAG 0x100F
#define NFAPI_NR_CONFIG_PRACH_CONFIGURATION_TAG 0x1031
#define NFAPI_NR_CONFIG_MULTI_PRACH_CONFIGURATION_TABLE_TAG 0x1032
#define NFAPI_NR_CONFIG_SSB_RESOURCE_CONFIGURATION_TABLE_TAG 0x1033
#define NFAPI_NR_CONFIG_MULTI_SSB_RESOURCE_CONFIGURATION_TABLE_TAG 0x1034
#define NFAPI_NR_CONFIG_TDD_TABLE_TAG 0x1035
#define NFAPI_NR_CONFIG_RSSI_MEASUREMENT_TAG 0x1028
#define NFAPI_NR_CONFIG_UCI_CONFIGURATION_TAG 0x1036
#define NFAPI_NR_CONFIG_PRB_SYMBOL_RATE_MATCH_PATTERNS_BITMAP_TAG 0x0137
#define NFAPI_NR_CONFIG_LTE_CRS_RATE_MATCH_PATTERNS_TAG 0x0138
#define NFAPI_NR_CONFIG_PUCCH_SEMI_STATIC_CONFIGURATION_TAG 0x1039
#define NFAPI_NR_CONFIG_PDSCH_SEMI_STATIC_CONFIGURATION_TAG 0x103A
#define NFAPI_NR_CONFIG_TIMING_WINDOW_TAG 0x011E
#define NFAPI_NR_CONFIG_TIMING_INFO_MODE_TAG 0x011F
#define NFAPI_NR_CONFIG_TIMING_INFO_PERIOD_TAG 0x0120
#define NFAPI_NR_CONFIG_NUM_TX_PORTS_TRP1_TAG 0x103B
#define NFAPI_NR_CONFIG_NUM_RX_PORTS_TRP1_TAG 0x103C

// 3.3.2.1 CONFIG.request
//table 3-30 phy config
typedef struct{
    nfapi_uint16_tlv_t phyProfileId;
    nfapi_uint8_tlv_t indicationInstancesPerSlot[6];
    nfapi_uint8_tlv_t requestInstancesPerSlot[4];
}nfapi_nr_phy_config_t;

//table 3-31 carrier config
typedef struct  {
  nfapi_uint16_tlv_t dl_bandwidth;//Carrier bandwidth for DL in MHz [38.104, sec 5.3.2] Values: 5, 10, 15, 20, 25, 30, 40,50, 60, 70, 80,90,100,200,400
  nfapi_uint32_tlv_t dl_frequency; //Absolute frequency of DL point A in KHz [38.104, sec5.2 and 38.211 sec 4.4.4.2] Value: 450000 -> 52600000
  nfapi_uint16_tlv_t dl_k0[5];//ð‘˜_{0}^{ðœ‡} for each of the numerologies [38.211, sec 5.3.1] Value: 0 ->23699
  nfapi_uint16_tlv_t dl_grid_size[5];//Grid size ð‘_{ð‘”ð‘Ÿð‘–ð‘‘}^{ð‘ ð‘–ð‘§ð‘’,ðœ‡} for each of the numerologies [38.211, sec 4.4.2] Value: 0->275 0 = this numerology not used
  nfapi_uint16_tlv_t num_tx_ant;//Number of Tx antennas
  nfapi_uint16_tlv_t uplink_bandwidth;//Carrier bandwidth for UL in MHz. [38.104, sec 5.3.2] Values: 5, 10, 15, 20, 25, 30, 40,50, 60, 70, 80,90,100,200,400
  nfapi_uint32_tlv_t uplink_frequency;//Absolute frequency of UL point A in KHz [38.104, sec5.2 and 38.211 sec 4.4.4.2] Value: 450000 -> 52600000
  nfapi_uint16_tlv_t ul_k0[5];//ð‘˜0 ðœ‡ for each of the numerologies [38.211, sec 5.3.1] Value: : 0 ->23699
  nfapi_uint16_tlv_t ul_grid_size[5];//Grid size ð‘ð‘”ð‘Ÿð‘–ð‘‘ ð‘ ð‘–ð‘§ð‘’,ðœ‡ for each of the numerologies [38.211, sec 4.4.2]. Value: 0->275 0 = this numerology not used
  nfapi_uint16_tlv_t num_rx_ant;
  nfapi_uint8_tlv_t  frequency_shift_7p5khz;
  nfapi_uint8_tlv_t PowerProfile;
  nfapi_uint8_tlv_t PowerOffsetRsIndex;
} nfapi_nr_carrier_config_t; 

//table 3-32 cell configuration
typedef struct {
  nfapi_uint16_tlv_t phy_cell_id;//Physical Cell ID, ð‘_{ð¼ð·}^{ð‘ð‘’ð‘™ð‘™} [38.211, sec 7.4.2.1] Value: 0 ->1007
  nfapi_uint8_tlv_t frame_duplex_type;//Frame duplex type Value: 0 = FDD 1 = TDD
  nfapi_uint8_tlv_t pdschTransTypeValidity;
  nfapi_uint8_tlv_t puschTransTypeValidity;
} nfapi_nr_cell_config_t;

//table 3-33 ssb power and pbch configuration
typedef struct {
  nfapi_int32_tlv_t ss_pbch_power;//SSB Block Power Value: TBD (-60..50 dBm)
  nfapi_uint16_tlv_t ssPbchBlockPowerScaling;
  nfapi_uint8_tlv_t  bch_payload;
} nfapi_nr_ssb_config_t;

//table 3-34 PRACH configuration
typedef struct {
  nfapi_uint16_tlv_t prach_root_sequence_index;//Starting logical root sequence index, ð‘–, equivalent to higher layer parameter prach-RootSequenceIndex [38.211, sec 6.3.3.1] Value: 0 -> 837
  nfapi_uint8_tlv_t  num_root_sequences;//Number of root sequences for a particular FD occasion that are required to generate the necessary number of preambles
  nfapi_uint16_tlv_t k1;//Frequency offset (from UL bandwidth part) for each FD. [38.211, sec 6.3.3.2] Value: from 0 to 272
  nfapi_uint8_tlv_t  prach_zero_corr_conf;//PRACH Zero CorrelationZone Config which is used to dervive ð‘ð‘ð‘  [38.211, sec 6.3.3.1] Value: from 0 to 15
  nfapi_uint16_tlv_t  num_unused_root_sequences;//Number of unused sequences available for noise estimation per FD occasion. At least one unused root sequence is required per FD occasion.
  nfapi_uint16_tlv_t* unused_root_sequences_list;//Unused root sequence or sequences per FD occasion. Required for noise estimation.
} nfapi_nr_num_prach_fd_occasions_t;
typedef struct {
    nfapi_uint16_tlv_t prachResConfigIndex;
    nfapi_uint8_tlv_t prach_sequence_length;//RACH sequence length. Only short sequence length is supported for FR2. [38.211, sec 6.3.3.1] Value: 0 = Long sequence 1 = Short sequence
    nfapi_uint8_tlv_t prach_sub_c_spacing;//Subcarrier spacing of PRACH. [38.211 sec 4.2] Value:0->4
    nfapi_uint8_tlv_t ulBwpPuschScs;
    nfapi_uint8_tlv_t restricted_set_config;//PRACH restricted set config Value: 0: unrestricted 1: restricted set type A 2: restricted set type B
    nfapi_uint8_tlv_t num_prach_fd_occasions;//Corresponds to the parameter ð‘€ in [38.211, sec 6.3.3.2] which equals the higher layer parameter msg1FDM Value: 1,2,4,8
    nfapi_uint8_tlv_t prach_ConfigurationIndex;//PRACH configuration index. Value:0->255
    nfapi_nr_num_prach_fd_occasions_t* num_prach_fd_occasions_list;
    nfapi_uint8_tlv_t ssb_per_rach;//SSB-per-RACH-occasion Value: 0: 1/8 1:1/4, 2:1/2 3:1 4:2 5:4, 6:8 7:16
} nfapi_nr_prach_config_t;

//table 3-35  Multi-PRACH configuration table
typedef struct{
    nfapi_uint16_tlv_t numPrachConfigurations;
    nfapi_nr_prach_config_t numPrachConfigurationsTLVs;
} nfapi_nr_multi_prach_config_table_t ;

//table 3-36 SSB resource configuration table
typedef struct{
    nfapi_uint32_tlv_t SsbMask;
}nfapi_nr_ssb_mask_list_t;
typedef struct{
    nfapi_uint8_tlv_t BeamId;
}nfapi_nr_ssb_beam_id_list_t;
typedef struct{
    nfapi_uint16_tlv_t ssbConfigIndex;
    nfapi_uint16_tlv_t ssbOffsetPointA;
    nfapi_uint8_tlv_t betaPssProfileNR;
    nfapi_uint16_tlv_t betaPssProfileSSS;
    nfapi_uint8_tlv_t ssbPeriod;
    nfapi_uint8_tlv_t ssbSubcarrierOffset;
    nfapi_uint8_tlv_t Case;
    nfapi_uint8_tlv_t subcarrierSpacing;
    nfapi_uint8_tlv_t subCarrierSpacingCommon;
    nfapi_nr_ssb_mask_list_t ssb_mask_list[2];
    nfapi_nr_ssb_beam_id_list_t ssb_id_list[64];
    nfapi_uint8_tlv_t lMax;
    nfapi_uint8_tlv_t rmsiPresence;
}nfapi_nr_ssb_resource_config_t;

//table 3-37 Multi-SSB resource configuration table
typedef struct{
    nfapi_uint8_tlv_t numSsbConfigurations;
    nfapi_nr_ssb_resource_config_t ssbConfigurations_TLVs;
}nfapi_nr_multi_ssb_resource_config_table_t;

//table 3-38 TDD table
typedef struct {
  nfapi_uint8_tlv_t slot_config;//For each symbol in each slot a uint8_t value is provided indicating: 0: DL slot 1: UL slot 2: Guard slot
} nfapi_nr_max_num_of_symbol_per_slot_t;
typedef struct {
  nfapi_nr_max_num_of_symbol_per_slot_t* max_num_of_symbol_per_slot_list;
} nfapi_nr_max_tdd_periodicity_t;
typedef struct {
  nfapi_uint8_tlv_t tdd_period;//DL UL Transmission Periodicity. Value:0: ms0p5 1: ms0p625 2: ms1 3: ms1p25 4: ms2 5: ms2p5 6: ms5 7: ms10 8: ms3 9: ms4
  nfapi_nr_max_tdd_periodicity_t* max_tdd_periodicity_list;
} nfapi_nr_tdd_table_t;

//table 3-39 Measurement configuration
typedef struct {
  nfapi_uint8_tlv_t rssi_measurement;//RSSI measurement unit. See Table 3-16 for RSSI definition. Value: 0: Do not report RSSI 1: dBm 2: dBFS
} nfapi_nr_measurement_config_t;

//table 3-40 UCI configuration
typedef struct{
    nfapi_uint8_tlv_t numPart1Params;
    nfapi_uint8_tlv_t* sizesPart1Params;// [numPart1Params]
    nfapi_uint16_tlv_t* map;//[2^(Î£(sizesPart1Params))]
}nfapi_nr_num_uci_to_maps_t;
typedef struct{
    nfapi_uint16_tlv_t numUci2Maps;
    nfapi_nr_num_uci_to_maps_t numucitomaps_list;
} nfapi_nr_uci_config_t;

//table 3-41 PRB-symbol rate match patterns bitmap (non-CORESET) configuration
typedef struct{
    nfapi_uint8_tlv_t prbSymbRateMatchPatternID;
    nfapi_uint8_tlv_t freqDomainRB[35];
    nfapi_uint8_tlv_t oneOrTwoSlots;
    nfapi_uint32_tlv_t symbolsInRB;
    nfapi_uint8_tlv_t timeDomainPeriodicity;
    nfapi_uint8_tlv_t timeDomainPattern[5];
    nfapi_uint8_tlv_t subcarrierSpacing;
}nfapi_nr_prb_symb_rate_match_patterns;
typedef struct{
    nfapi_uint8_tlv_t numberOfPrb_SymbRateMatch_Patterns;
    nfapi_nr_prb_symb_rate_match_patterns  PrbSymbRateMatchPattern;
}nfapi_nr_prb_symbol_rate_match_pattern_bitmap_config_t;

//Table 3-42 LTE-CRS rate match patterns configuration
typedef struct{
    nfapi_uint8_tlv_t radioframeAllocationPeriod;
    nfapi_uint8_tlv_t radioframeAllocationOffset;
    nfapi_uint8_tlv_t lteFrameStructureType;
    nfapi_uint8_tlv_t subframeAllocLength;
    nfapi_uint8_tlv_t subframeAllocationBitmap;
}nfapi_nr_size_mbsfn_subframe_config_list_t;
typedef struct{
    nfapi_uint8_tlv_t crsRateMatchPatternID;
    nfapi_uint16_tlv_t carrierFreqDL;
    nfapi_uint8_tlv_t carrierBandwidthDL;
    nfapi_uint8_tlv_t nrofCrsPorts;
    nfapi_uint8_tlv_t vShift;
    nfapi_uint8_tlv_t sizeMbsfnSubframeConfigList;
    nfapi_nr_size_mbsfn_subframe_config_list_t sizeMbsfnSubframeConfig_list;
}nfapi_nr_each_LteCRS_RateMatchPattern_t;
typedef struct{
    nfapi_uint8_tlv_t numberOfLteCRS_RateMatchPatterns;
    nfapi_nr_each_LteCRS_RateMatchPattern_t LteCRS_RateMatchPattern_list;
} nfapi_nr_lte_crs_rate_match_patterns_config_t;

//table 3-43 PUCCH semi-static configuration
typedef struct{
    nfapi_uint8_tlv_t pucchGroupHopping;
    nfapi_uint16_tlv_t nIdPucchHopping;
}nfapi_nr_ul_bwp_id_t;
typedef struct{
    nfapi_uint8_tlv_t numUlBwpIds;
    nfapi_nr_ul_bwp_id_t UlBwpId_list;
}nfapi_nr_pucch_semi_static_config_t;
//table 3-44 PDSCH semi-static configuration
typedef struct {
    nfapi_uint8_tlv_t pdschCbgScheme;
}nfapi_nr_pdsch_semi_static_config_t;

//table 3-45 delay management configuration
typedef struct {
    nfapi_uint16_tlv_t timing_window;
    nfapi_uint8_tlv_t timing_info_mode;
    nfapi_uint8_tlv_t timing_info_period;
}nfapi_nr_delay_management_config_t;

//Table 3-46 Rel-16 mTRP configuration
typedef struct{
    nfapi_uint8_tlv_t numTxPortsTRP1;
    nfapi_uint8_tlv_t numRxPortsTRP1;
}nfapi_nr_rel16_mtrp_config_t;

/* 3.3.7 Storing Precoding and Beamforming Tables */
//table 3-51 Digital beam table (DBT) PDU
typedef struct {
	uint16_t dig_beam_weight_Re;
    uint16_t dig_beam_weight_Im;
} nfapi_nr_txru_t;
typedef struct {
	uint16_t beam_idx;    
    nfapi_nr_txru_t*  txru_list;
} nfapi_nr_dig_beam_t;
typedef struct {
	uint16_t num_dig_beams; 
    uint16_t num_txrus;
    nfapi_nr_dig_beam_t* dig_beam_list;
} nfapi_nr_dbt_pdu_t;

//table 3-52 Precoding matrix (PM) PDU
typedef struct {
	int16_t precoder_weight_Re;
    int16_t precoder_weight_Im;
} nfapi_nr_num_ant_ports_t;
typedef struct {
	nfapi_nr_num_ant_ports_t* num_ant_ports_list;
} nfapi_nr_num_layers_t;
typedef struct {
    uint16_t pm_idx;       
    uint16_t numLayers;
    uint16_t numAntPorts;
    nfapi_nr_num_layers_t* num_layers_list;   
} nfapi_nr_pm_pdu_t;

//Table 3-29 (total)
typedef struct {
    nfapi_nr_p5_message_header_t header;
  
    uint8_t                       num_tlv;

    nfapi_nr_phy_config_t         phy_config;//30
    nfapi_nr_carrier_config_t     carrier_config;//31
    nfapi_nr_cell_config_t        cell_config;//32
    nfapi_nr_ssb_config_t         ssb_config;//33
    nfapi_nr_prach_config_t       prach_config;//34
    //may fix !
    nfapi_nr_multi_prach_config_table_t multi_prach_config;//35
    nfapi_nr_ssb_resource_config_t ssb_resource_config;//36
    nfapi_nr_multi_ssb_resource_config_table_t multissbresourceconfig;//37
    nfapi_nr_tdd_table_t          tdd_table;//38
    nfapi_nr_measurement_config_t measurement_config;//39
    nfapi_nr_uci_config_t uci_config;//40
    nfapi_nr_prb_symbol_rate_match_pattern_bitmap_config_t prbsymbol_config;//41
    nfapi_nr_lte_crs_rate_match_patterns_config_t ltecrs_config;//42
    //may fix !
    nfapi_nr_pucch_semi_static_config_t pucch_semi_static_config;//43
    nfapi_nr_pdsch_semi_static_config_t pdsch_semi_static_config;//44
    nfapi_nr_delay_management_config_t  delay_management_config;//45
    nfapi_nr_rel16_mtrp_config_t Rel16_mTRP_config;//46
    nfapi_nr_dbt_pdu_t digital_beam_dbt_pdu;//50
    nfapi_nr_pm_pdu_t precoding_matrix_PDU;//51
} nfapi_nr_config_request_scf_t;
// 3.3.2.2 CONFIG.response

typedef struct {
  nfapi_nr_p5_message_header_t header;
  uint8_t error_code;
} nfapi_nr_config_response_scf_t;


// 3.3.2.3 CONFIG errors
typedef enum {    
  NFAPI_NR_CONFIG_MSG_OK = 0,
  NFAPI_NR_CONFIG_MSG_INVALID_CONFIG  
} nfapi_nr_config_errors_e;


/* 3.3.4 START */
// 3.3.4.1 START.request
typedef struct{
  nfapi_nr_p5_message_header_t header;
}nfapi_nr_start_request_scf_t;

// 3.3.4.2 START.errors
typedef enum {
    NFAPI_NR_START_MSG_INVALID_STATE
} nfapi_nr_start_errors_e;
// 3.3.4.3 START.reponse
typedef struct {
  nfapi_nr_p5_message_header_t header;
  nfapi_nr_start_errors_e error_code;
} nfapi_nr_start_response_scf_t;

/* 3.3.5 STOP */
// 3.3.5.1 STOP.request
typedef struct {
	nfapi_nr_p5_message_header_t header;
} nfapi_nr_stop_request_t;
// 3.3.5.2 STOP.indication
typedef struct {
	nfapi_nr_p5_message_header_t header;
} nfapi_nr_stop_indication_t;
